{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\gensim\\utils.py:1212: UserWarning: detected Windows; aliasing chunkize to chunkize_serial\n",
      "  warnings.warn(\"detected Windows; aliasing chunkize to chunkize_serial\")\n"
     ]
    }
   ],
   "source": [
    "#added to use driver\n",
    "import csv\n",
    "import numpy as np\n",
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import operator\n",
    "import re\n",
    "import math\n",
    "import random\n",
    "from random import randint\n",
    "import numpy as np\n",
    "import argparse\n",
    "import torch\n",
    "import torch.autograd as autograd\n",
    "from torch import nn, optim\n",
    "from torch.autograd import Variable\n",
    "import torch.nn.functional as F\n",
    "from datetime import datetime\n",
    "import networkx as nx\n",
    "from node2vec import Node2Vec\n",
    "from gensim.models import Word2Vec"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = \"bolt://localhost:7687\"\n",
    "driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"a\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "#no need to run again as  I have exported embedidng and model \n",
    "\n",
    "def createembedding(file, query):\n",
    "    print('Create the edge list')\n",
    "    with driver.session() as session, open(file, \"w\") as edges_file:\n",
    "        result = session.run(query)\n",
    "\n",
    "        writer = csv.writer(edges_file, delimiter=\" \")\n",
    "\n",
    "        for row in result:\n",
    "            writer.writerow([row[\"source\"], row[\"target\"]])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def createNode2Vec(file, EMBEDDING_FILENAME, EMBEDDING_MODEL_FILENAME):   \n",
    "    # Create a graph\n",
    "    graph=nx.read_edgelist(file, create_using = nx.DiGraph(), nodetype = None, data = [('weight', int)])\n",
    "\n",
    "    # Precompute probabilities and generate walks\n",
    "    node2vec = Node2Vec(graph, dimensions=10, walk_length=3, num_walks=20, workers=4)\n",
    "\n",
    "    ## if d_graph is big enough to fit in the memory, pass temp_folder which has enough disk space\n",
    "    # Note: It will trigger \"sharedmem\" in Parallel, which will be slow on smaller graphs\n",
    "    #node2vec = Node2Vec(graph, dimensions=64, walk_length=30, num_walks=200, workers=4, temp_folder=\"/mnt/tmp_data\")\n",
    "    # Embed\n",
    "    model = node2vec.fit(window=10, min_count=1, batch_words=4)  # Any keywords acceptable by gensim.Word2Vec can be passed, `diemnsions` and `workers` are automatically passed (from the Node2Vec constructor)\n",
    "\n",
    "    # Look for most similar nodes\n",
    "    #model.wv.most_similar('2')  # Output node names are always strings\n",
    "\n",
    "    # Save embeddings for later use\n",
    "    model.wv.save_word2vec_format(EMBEDDING_FILENAME)\n",
    "\n",
    "    # Save model for later use\n",
    "    model.save(EMBEDDING_MODEL_FILENAME)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Create the edge list\n"
     ]
    }
   ],
   "source": [
    "#FILES - #no need to run again as  I have exported embedidng and model \n",
    "file = 'graph/movies.edgelist'\n",
    "EMBEDDING_FILENAME = 'emb/node2vecmov.emb'\n",
    "EMBEDDING_MODEL_FILENAME = 'emb/embdnode2vecmov.model'\n",
    "movienode2vecquery = \"\"\"\\\n",
    "        MATCH (m:Movie)--(other)\n",
    "        RETURN id(m) AS source, id(other) AS target\n",
    "        \"\"\"\n",
    "\n",
    "createembedding(file, movienode2vecquery)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Computing transition probabilities: 100%|███████████████████████████████████████| 9980/9980 [00:00<00:00, 10788.50it/s]\n",
      "C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\smart_open\\smart_open_lib.py:402: UserWarning: This function is deprecated, use smart_open.open instead. See the migration notes for details: https://github.com/RaRe-Technologies/smart_open/blob/master/README.rst#migrating-to-the-new-open-function\n",
      "  'See the migration notes for details: %s' % _MIGRATION_NOTES_URL\n"
     ]
    }
   ],
   "source": [
    "#no need to run again as  I have exported embedidng and model \n",
    "createNode2Vec(file, EMBEDDING_FILENAME, EMBEDDING_MODEL_FILENAME)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Create the edge list\n"
     ]
    }
   ],
   "source": [
    "#no need to run again as  I have exported embedidng and model \n",
    "file = 'graph/users.edgelist'\n",
    "EMBEDDING_FILENAME = 'emb/node2vecuser.emb'\n",
    "EMBEDDING_MODEL_FILENAME = 'emb/embdnode2vecuser.model'\n",
    "usernode2vecquery = \"\"\"\\\n",
    "        MATCH (u:User)--(other)\n",
    "        RETURN id(u) AS source, id(other) AS target\n",
    "        \"\"\"\n",
    "createembedding(file, usernode2vecquery)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Computing transition probabilities: 100%|███████████████████████████████████████| 6257/6257 [00:00<00:00, 26249.72it/s]\n",
      "C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\smart_open\\smart_open_lib.py:402: UserWarning: This function is deprecated, use smart_open.open instead. See the migration notes for details: https://github.com/RaRe-Technologies/smart_open/blob/master/README.rst#migrating-to-the-new-open-function\n",
      "  'See the migration notes for details: %s' % _MIGRATION_NOTES_URL\n"
     ]
    }
   ],
   "source": [
    "#no need to run again as  I have exported embedidng and model \n",
    "createNode2Vec(file, EMBEDDING_FILENAME, EMBEDDING_MODEL_FILENAME)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "EMBEDDING_MODEL_FILENAME = 'emb/embdnode2vecmov.model'\n",
    "model = Word2Vec.load(EMBEDDING_MODEL_FILENAME)\n",
    "#model.train([[\"hello\", \"world\"]], total_examples=1, epochs=1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('5697', 0.8905104398727417),\n",
       " ('556', 0.8781545162200928),\n",
       " ('6899', 0.8701952695846558),\n",
       " ('3646', 0.8629645109176636),\n",
       " ('9559', 0.8580236434936523),\n",
       " ('6889', 0.8575080633163452),\n",
       " ('9129', 0.8424545526504517),\n",
       " ('106', 0.8383544683456421),\n",
       " ('2252', 0.8276394009590149),\n",
       " ('1993', 0.8236179947853088)]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "model.wv.most_similar('2')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "movies_ratings_query = \"\"\"\\\n",
    "MATCH (u:User)-[r:RATED]->(m:Movie)\n",
    "WITH distinct r.rating as ratings ORDER BY r.rating\n",
    "WITH collect(ratings) AS ratings\n",
    "MATCH (u:User)-[r:RATED]->(m:Movie)\n",
    "WITH ratings, id(u) AS source, m.embedding AS embedding, id(m) AS movie, r.rating AS target, r.timestamp AS Time\n",
    "RETURN source, embedding, movie, target, Time, \n",
    "[r in ratings | CASE WHEN r in target THEN 1 ELSE 0 END] AS ratings ORDER BY Time ASC\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(movies_ratings_query)\n",
    "    df = pd.DataFrame([dict(row) for row in result])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>embedding</th>\n",
       "      <th>movie</th>\n",
       "      <th>target</th>\n",
       "      <th>Time</th>\n",
       "      <th>ratings</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>9891</td>\n",
       "      <td>[-0.0058479453, 0.0019804768, 0.0040325085, -0...</td>\n",
       "      <td>3058</td>\n",
       "      <td>3.0</td>\n",
       "      <td>1000899120</td>\n",
       "      <td>[0, 0, 0, 0, 0, 1, 0, 0, 0, 0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>9957</td>\n",
       "      <td>[-0.007443971, 0.0009501985, -0.003198112, 0.0...</td>\n",
       "      <td>644</td>\n",
       "      <td>3.0</td>\n",
       "      <td>1001975811</td>\n",
       "      <td>[0, 0, 0, 0, 0, 1, 0, 0, 0, 0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>9957</td>\n",
       "      <td>[0.0016236857, -0.0013796845, -0.0007558407, -...</td>\n",
       "      <td>2078</td>\n",
       "      <td>5.0</td>\n",
       "      <td>1001975853</td>\n",
       "      <td>[0, 0, 0, 0, 0, 0, 0, 0, 0, 1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>9957</td>\n",
       "      <td>[-0.001516504, -0.0076829926, -0.0056096804, 0...</td>\n",
       "      <td>1213</td>\n",
       "      <td>2.0</td>\n",
       "      <td>1001975853</td>\n",
       "      <td>[0, 0, 0, 1, 0, 0, 0, 0, 0, 0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>9957</td>\n",
       "      <td>[0.004472015, 0.0024092905, 0.0056105647, 0.00...</td>\n",
       "      <td>1110</td>\n",
       "      <td>4.0</td>\n",
       "      <td>1001975853</td>\n",
       "      <td>[0, 0, 0, 0, 0, 0, 0, 1, 0, 0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   source                                          embedding  movie  target  \\\n",
       "0    9891  [-0.0058479453, 0.0019804768, 0.0040325085, -0...   3058     3.0   \n",
       "1    9957  [-0.007443971, 0.0009501985, -0.003198112, 0.0...    644     3.0   \n",
       "2    9957  [0.0016236857, -0.0013796845, -0.0007558407, -...   2078     5.0   \n",
       "3    9957  [-0.001516504, -0.0076829926, -0.0056096804, 0...   1213     2.0   \n",
       "4    9957  [0.004472015, 0.0024092905, 0.0056105647, 0.00...   1110     4.0   \n",
       "\n",
       "         Time                         ratings  \n",
       "0  1000899120  [0, 0, 0, 0, 0, 1, 0, 0, 0, 0]  \n",
       "1  1001975811  [0, 0, 0, 0, 0, 1, 0, 0, 0, 0]  \n",
       "2  1001975853  [0, 0, 0, 0, 0, 0, 0, 0, 0, 1]  \n",
       "3  1001975853  [0, 0, 0, 1, 0, 0, 0, 0, 0, 0]  \n",
       "4  1001975853  [0, 0, 0, 0, 0, 0, 0, 1, 0, 0]  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#What does our DataFrame look like at the moment?\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv('Node2Vec_TrainingData.csv')\n",
    "#df = pd.read_csv('Node2Vec_TrainingData.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\ipykernel_launcher.py:7: FutureWarning: The 'get_values' method is deprecated and will be removed in a future version. Use '.to_numpy()' or '.array' instead.\n",
      "  import sys\n"
     ]
    }
   ],
   "source": [
    "train_index = int(len(df) * 0.9)\n",
    "train_data = df[:train_index]\n",
    "test_data = df[train_index:]\n",
    "\n",
    "train_x = train_data.loc[:, \"embedding\"]\n",
    "train_x = pd.DataFrame(np.array([np.array(item) for item in train_x.values]))\n",
    "train_x.columns = [str(col) for col in train_x.columns.get_values()]\n",
    "train_y = train_data.loc[:, 'ratings']\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\ipykernel_launcher.py:4: FutureWarning: The 'get_values' method is deprecated and will be removed in a future version. Use '.to_numpy()' or '.array' instead.\n",
      "  after removing the cwd from sys.path.\n"
     ]
    }
   ],
   "source": [
    "# separate test data\n",
    "test_x = test_data.loc[:, \"embedding\"]\n",
    "test_x = pd.DataFrame(np.array([np.array(item) for item in test_x.values]))\n",
    "test_x.columns = [str(col) for col in train_x.columns.get_values()]\n",
    "\n",
    "test_y = test_data.loc[:, 'ratings']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Building Tensorflow model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "from tensorflow.python.feature_column import feature_column_lib\n",
    "from tensorflow.python.training import training_util\n",
    "from tensorflow.python.training.ftrl import FtrlOptimizer\n",
    "\n",
    "import tensorflow as tf"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "create a simple multi label classifier because a movie can have more than one genre associated with it"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def train_input_fn(features, labels, batch_size):\n",
    "    labels = tf.constant(np.array([np.array(item)\n",
    "                                   for item in labels.values]))\n",
    "    dataset = tf.data.Dataset.from_tensor_slices((dict(features), labels))\n",
    "    return dataset.shuffle(1000).repeat().batch(batch_size)\n",
    "\n",
    "\n",
    "def eval_input_fn(features, labels, batch_size):\n",
    "    labels = tf.constant(np.array([np.array(item)\n",
    "                                   for item in labels.values]))\n",
    "\n",
    "    features = dict(features)\n",
    "    inputs = (features, labels)\n",
    "    dataset = tf.data.Dataset.from_tensor_slices(inputs)\n",
    "\n",
    "    assert batch_size is not None, \"batch_size must not be None\"\n",
    "    return dataset.batch(batch_size)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "def model_fn(features, labels, mode, config):\n",
    "    def train_op_fn(loss):\n",
    "        opt = FtrlOptimizer(learning_rate=LEARNING_RATE)\n",
    "        return opt.minimize(loss,\n",
    "                            global_step=training_util.get_global_step())\n",
    "\n",
    "    def logit_fn(features):\n",
    "        return feature_column_lib.linear_model(\n",
    "            features=features,\n",
    "            feature_columns=feature_columns,\n",
    "            units=head.logits_dimension)\n",
    "\n",
    "    return head.create_estimator_spec(\n",
    "        features=features,\n",
    "        mode=mode,\n",
    "        logits=logit_fn(features=features),\n",
    "        labels=labels,\n",
    "        train_op_fn=train_op_fn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "def predict_input_fn(df_data, num_epochs):\n",
    "        return tf.estimator.inputs.pandas_input_fn(\n",
    "            x=df_data,\n",
    "            num_epochs=num_epochs,\n",
    "           shuffle=False\n",
    "        )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO:tensorflow:Using default config.\n",
      "WARNING:tensorflow:Using temporary folder as model directory: C:\\Users\\meetn\\AppData\\Local\\Temp\\tmpclz8gzqr\n",
      "INFO:tensorflow:Using config: {'_model_dir': 'C:\\\\Users\\\\meetn\\\\AppData\\\\Local\\\\Temp\\\\tmpclz8gzqr', '_tf_random_seed': None, '_save_summary_steps': 100, '_save_checkpoints_steps': None, '_save_checkpoints_secs': 600, '_session_config': allow_soft_placement: true\n",
      "graph_options {\n",
      "  rewrite_options {\n",
      "    meta_optimizer_iterations: ONE\n",
      "  }\n",
      "}\n",
      ", '_keep_checkpoint_max': 5, '_keep_checkpoint_every_n_hours': 10000, '_log_step_count_steps': 100, '_train_distribute': None, '_device_fn': None, '_protocol': None, '_eval_distribute': None, '_experimental_distribute': None, '_experimental_max_worker_delay_secs': None, '_session_creation_timeout_secs': 7200, '_service': None, '_cluster_spec': <tensorflow.python.training.server_lib.ClusterSpec object at 0x000002B29350EE88>, '_task_type': 'worker', '_task_id': 0, '_global_id_in_cluster': 0, '_master': '', '_evaluation_master': '', '_is_chief': True, '_num_ps_replicas': 0, '_num_worker_replicas': 1}\n",
      "WARNING:tensorflow:From C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\tensorflow_core\\python\\ops\\resource_variable_ops.py:1630: calling BaseResourceVariable.__init__ (from tensorflow.python.ops.resource_variable_ops) with constraint is deprecated and will be removed in a future version.\n",
      "Instructions for updating:\n",
      "If using Keras pass *_constraint arguments to layers.\n",
      "WARNING:tensorflow:From C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\tensorflow_core\\python\\training\\training_util.py:236: Variable.initialized_value (from tensorflow.python.ops.variables) is deprecated and will be removed in a future version.\n",
      "Instructions for updating:\n",
      "Use Variable.read_value. Variables in 2.X are initialized automatically both in eager and graph (inside tf.defun) contexts.\n",
      "INFO:tensorflow:Calling model_fn.\n",
      "WARNING:tensorflow:Layer linear_model is casting an input tensor from dtype float64 to the layer's dtype of float32, which is new behavior in TensorFlow 2.  The layer has dtype float32 because it's dtype defaults to floatx.\n",
      "\n",
      "If you intended to run this layer in float32, you can safely ignore this warning. If in doubt, this warning is likely only an issue if you are porting a TensorFlow 1.X model to TensorFlow 2.\n",
      "\n",
      "To change all layers to have dtype float64 by default, call `tf.keras.backend.set_floatx('float64')`. To change just this layer, pass dtype='float64' to the layer constructor. If you are the author of this layer, you can disable autocasting by passing autocast=False to the base Layer constructor.\n",
      "\n",
      "WARNING:tensorflow:From C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\tensorflow_core\\python\\feature_column\\feature_column.py:558: NumericColumn._variable_shape (from tensorflow.python.feature_column.feature_column_v2) is deprecated and will be removed in a future version.\n",
      "Instructions for updating:\n",
      "The old _FeatureColumn APIs are being deprecated. Please use the new FeatureColumn APIs instead.\n",
      "WARNING:tensorflow:From C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\tensorflow_core\\python\\feature_column\\feature_column.py:563: Layer.add_variable (from tensorflow.python.keras.engine.base_layer) is deprecated and will be removed in a future version.\n",
      "Instructions for updating:\n",
      "Please use `layer.add_weight` method instead.\n",
      "WARNING:tensorflow:From C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\tensorflow_core\\python\\feature_column\\feature_column.py:1941: NumericColumn._get_dense_tensor (from tensorflow.python.feature_column.feature_column_v2) is deprecated and will be removed in a future version.\n",
      "Instructions for updating:\n",
      "The old _FeatureColumn APIs are being deprecated. Please use the new FeatureColumn APIs instead.\n",
      "WARNING:tensorflow:From C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\tensorflow_core\\python\\feature_column\\feature_column.py:2158: NumericColumn._transform_feature (from tensorflow.python.feature_column.feature_column_v2) is deprecated and will be removed in a future version.\n",
      "Instructions for updating:\n",
      "The old _FeatureColumn APIs are being deprecated. Please use the new FeatureColumn APIs instead.\n",
      "INFO:tensorflow:Done calling model_fn.\n",
      "INFO:tensorflow:Create CheckpointSaverHook.\n",
      "INFO:tensorflow:Graph was finalized.\n",
      "INFO:tensorflow:Running local_init_op.\n",
      "INFO:tensorflow:Done running local_init_op.\n",
      "INFO:tensorflow:Saving checkpoints for 0 into C:\\Users\\meetn\\AppData\\Local\\Temp\\tmpclz8gzqr\\model.ckpt.\n",
      "INFO:tensorflow:loss = 0.6931472, step = 0\n",
      "INFO:tensorflow:global_step/sec: 122.522\n",
      "INFO:tensorflow:loss = 0.33743653, step = 100 (0.817 sec)\n",
      "INFO:tensorflow:global_step/sec: 202.555\n",
      "INFO:tensorflow:loss = 0.3006909, step = 200 (0.493 sec)\n",
      "INFO:tensorflow:global_step/sec: 203.114\n",
      "INFO:tensorflow:loss = 0.26982838, step = 300 (0.492 sec)\n",
      "INFO:tensorflow:global_step/sec: 209.238\n",
      "INFO:tensorflow:loss = 0.29638565, step = 400 (0.479 sec)\n",
      "INFO:tensorflow:global_step/sec: 217.692\n",
      "INFO:tensorflow:loss = 0.2859874, step = 500 (0.458 sec)\n",
      "INFO:tensorflow:global_step/sec: 205.809\n",
      "INFO:tensorflow:loss = 0.27084523, step = 600 (0.486 sec)\n",
      "INFO:tensorflow:global_step/sec: 215.754\n",
      "INFO:tensorflow:loss = 0.29040134, step = 700 (0.463 sec)\n",
      "INFO:tensorflow:global_step/sec: 223.084\n",
      "INFO:tensorflow:loss = 0.2877755, step = 800 (0.449 sec)\n",
      "INFO:tensorflow:global_step/sec: 222.648\n",
      "INFO:tensorflow:loss = 0.295157, step = 900 (0.448 sec)\n",
      "INFO:tensorflow:global_step/sec: 223.003\n",
      "INFO:tensorflow:loss = 0.29301953, step = 1000 (0.448 sec)\n",
      "INFO:tensorflow:global_step/sec: 223.855\n",
      "INFO:tensorflow:loss = 0.29611284, step = 1100 (0.447 sec)\n",
      "INFO:tensorflow:global_step/sec: 223.171\n",
      "INFO:tensorflow:loss = 0.2999625, step = 1200 (0.449 sec)\n",
      "INFO:tensorflow:global_step/sec: 214.114\n",
      "INFO:tensorflow:loss = 0.26451677, step = 1300 (0.466 sec)\n",
      "INFO:tensorflow:global_step/sec: 223.623\n",
      "INFO:tensorflow:loss = 0.28405327, step = 1400 (0.447 sec)\n",
      "INFO:tensorflow:global_step/sec: 222.92\n",
      "INFO:tensorflow:loss = 0.28874078, step = 1500 (0.449 sec)\n",
      "INFO:tensorflow:global_step/sec: 222.415\n",
      "INFO:tensorflow:loss = 0.27149558, step = 1600 (0.450 sec)\n",
      "INFO:tensorflow:global_step/sec: 223.253\n",
      "INFO:tensorflow:loss = 0.3039318, step = 1700 (0.448 sec)\n",
      "INFO:tensorflow:global_step/sec: 223.656\n",
      "INFO:tensorflow:loss = 0.29063186, step = 1800 (0.448 sec)\n",
      "INFO:tensorflow:global_step/sec: 214.442\n",
      "INFO:tensorflow:loss = 0.27620658, step = 1900 (0.466 sec)\n",
      "INFO:tensorflow:Saving checkpoints for 2000 into C:\\Users\\meetn\\AppData\\Local\\Temp\\tmpclz8gzqr\\model.ckpt.\n",
      "INFO:tensorflow:Loss for final step: 0.29887015.\n",
      "INFO:tensorflow:Calling model_fn.\n",
      "WARNING:tensorflow:Layer linear_model is casting an input tensor from dtype float64 to the layer's dtype of float32, which is new behavior in TensorFlow 2.  The layer has dtype float32 because it's dtype defaults to floatx.\n",
      "\n",
      "If you intended to run this layer in float32, you can safely ignore this warning. If in doubt, this warning is likely only an issue if you are porting a TensorFlow 1.X model to TensorFlow 2.\n",
      "\n",
      "To change all layers to have dtype float64 by default, call `tf.keras.backend.set_floatx('float64')`. To change just this layer, pass dtype='float64' to the layer constructor. If you are the author of this layer, you can disable autocasting by passing autocast=False to the base Layer constructor.\n",
      "\n",
      "INFO:tensorflow:Done calling model_fn.\n",
      "INFO:tensorflow:Starting evaluation at 2019-11-28T05:03:07Z\n",
      "INFO:tensorflow:Graph was finalized.\n",
      "INFO:tensorflow:Restoring parameters from C:\\Users\\meetn\\AppData\\Local\\Temp\\tmpclz8gzqr\\model.ckpt-2000\n",
      "INFO:tensorflow:Running local_init_op.\n",
      "INFO:tensorflow:Done running local_init_op.\n",
      "INFO:tensorflow:Finished evaluation at 2019-11-28-05:03:08\n",
      "INFO:tensorflow:Saving dict for global step 2000: auc = 0.7774985, auc_precision_recall = 0.2605392, average_loss = 0.28180882, global_step = 2000, loss = 0.28173125\n",
      "INFO:tensorflow:Saving 'checkpoint_path' summary for global step 2000: C:\\Users\\meetn\\AppData\\Local\\Temp\\tmpclz8gzqr\\model.ckpt-2000\n",
      "{'auc': 0.7774985, 'auc_precision_recall': 0.2605392, 'average_loss': 0.28180882, 'loss': 0.28173125, 'global_step': 2000}\n",
      "\n",
      "Test set AUC: 0.777\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "feature_columns = [tf.feature_column.numeric_column(key=key)\n",
    "                   for key in train_x.keys()]\n",
    "\n",
    "LEARNING_RATE = 0.3\n",
    "loss_reduction = tf.losses.Reduction.SUM_OVER_BATCH_SIZE\n",
    "\n",
    "head = tf.compat.v1.estimator.MultiLabelHead(10, weight_column=None, label_vocabulary=None,loss_reduction=loss_reduction)\n",
    "\n",
    "classifier = tf.estimator.Estimator(model_fn=model_fn)\n",
    "\n",
    "classifier.train(\n",
    "    input_fn=lambda: train_input_fn(train_x, train_y, 100),\n",
    "    steps=2000)\n",
    "\n",
    "eval_result = classifier.evaluate(\n",
    "    input_fn=lambda: eval_input_fn(test_x, test_y, 100))\n",
    "\n",
    "print(eval_result)\n",
    "print('\\nTest set AUC: {auc:0.3f}\\n'.format(**eval_result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ratings_query = \"\"\"\\\n",
    "MATCH (u:User)-[r:RATED]->(m:Movie)\n",
    "WITH distinct r.rating as ratings ORDER BY r.rating\n",
    "RETURN collect(ratings) AS ratings\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(ratings_query)\n",
    "    ratings = result.peek()[\"ratings\"]\n",
    "\n",
    "ratings"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For each user, get 5 movies and get Top 5 similar movies, which the user has not rated yet."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'movies_ratings_predict_query = \"\"\"MATCH (u:User)-[r0:RATED]->(m:Movie)<-[:RATED]-(o:User) \\nMATCH (o)-[r:RATED]->(m1:Movie) WHERE NOT EXISTS( (u)-[:RATED]->(m1) ) \\nWITH id(u) AS source, m1.embedding AS embedding, id(m1) AS movie\\nRETURN source, embedding, movie, 0, [0, 0, 0, 0, 0, 0, 0, 0, 0, 0] AS ratings\\nORDER BY RAND()\\nLIMIT 100\\n\"\"\" \\n\\nwith driver.session() as session:\\n    result = session.run(movies_ratings_predict_query)\\n    predict_df = pd.DataFrame([dict(row) for row in result])\\n    \\npredict_df.to_csv(\\'node2Vec_forprediction.csv\\')'"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#This is taking lots of time, hence would use pandas to generate the nodes. \n",
    "'''movies_ratings_predict_query = \"\"\"\\\n",
    "MATCH (u:User)-[r0:RATED]->(m:Movie)<-[:RATED]-(o:User) \n",
    "MATCH (o)-[r:RATED]->(m1:Movie) WHERE NOT EXISTS( (u)-[:RATED]->(m1) ) \n",
    "WITH id(u) AS source, m1.embedding AS embedding, id(m1) AS movie\n",
    "RETURN source, embedding, movie, 0, [0, 0, 0, 0, 0, 0, 0, 0, 0, 0] AS ratings\n",
    "ORDER BY RAND()\n",
    "LIMIT 100\n",
    "\"\"\" \n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(movies_ratings_predict_query)\n",
    "    predict_df = pd.DataFrame([dict(row) for row in result])\n",
    "    \n",
    "predict_df.to_csv('node2Vec_forprediction.csv')'''"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Hence decided to get all users. Loop through user dataframe and pass each user to the below query, get the user-movies data for which user has not rated the movie"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>9810</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>9829</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>5150</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>9889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>9841</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   source\n",
       "0    9810\n",
       "1    9829\n",
       "2    5150\n",
       "3    9889\n",
       "4    9841"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ratings_query = \"\"\"\\\n",
    "MATCH (u:User)-[r:RATED]->(m:Movie)\n",
    "RETURN distinct id(u) As source\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(ratings_query)\n",
    "    allusers = pd.DataFrame([dict(row) for row in result])\n",
    "\n",
    "allusers.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "9810\n"
     ]
    }
   ],
   "source": [
    "movies_ratings_predict_query = \"\"\"\\\n",
    "MATCH (u:User)-[r0:RATED]->(m:Movie)<-[:RATED]-(o:User) \n",
    "MATCH (o)-[r:RATED]->(m1:Movie) WHERE NOT EXISTS( (u:User {id: {sourceId}})-[:RATED]->(m1) )\n",
    "WITH id(u) AS source, m1.embedding AS embedding, id(m1) AS movie\n",
    "RETURN source, embedding, movie, 0, [0, 0, 0, 0, 0, 0, 0, 0, 0, 0] AS ratings\n",
    "ORDER BY RAND()\n",
    "LIMIT 100\n",
    "\"\"\" \n",
    "new_predict_df = pd.DataFrame() \n",
    "for index, row in allusers.iterrows():\n",
    "    print(row['source'])\n",
    "    with driver.session() as session:\n",
    "        result = session.run(movies_ratings_predict_query, sourceId=str(row['source']))\n",
    "        predict_df = pd.DataFrame([dict(row) for row in result]) \n",
    "        new_predict_df.append(predict_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>embedding</th>\n",
       "      <th>movie</th>\n",
       "      <th>0</th>\n",
       "      <th>ratings</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>9891</td>\n",
       "      <td>[0.0020742759,0.0050524846,-0.003386466,0.0028...</td>\n",
       "      <td>4321</td>\n",
       "      <td>0</td>\n",
       "      <td>[0,0,0,0,0,0,0,0,0,0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>9891</td>\n",
       "      <td>[0.0054219505,0.0052860463,-0.0050404333,-0.00...</td>\n",
       "      <td>135</td>\n",
       "      <td>0</td>\n",
       "      <td>[0,0,0,0,0,0,0,0,0,0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>9891</td>\n",
       "      <td>[0.0024830783,-0.003575973,0.0061229025,0.0041...</td>\n",
       "      <td>5285</td>\n",
       "      <td>0</td>\n",
       "      <td>[0,0,0,0,0,0,0,0,0,0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>9891</td>\n",
       "      <td>[0.0069850828,0.0008707234,0.0068662665,0.0029...</td>\n",
       "      <td>2741</td>\n",
       "      <td>0</td>\n",
       "      <td>[0,0,0,0,0,0,0,0,0,0]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>9891</td>\n",
       "      <td>[-0.006761877,0.0060815695,0.0057708365,0.0073...</td>\n",
       "      <td>559</td>\n",
       "      <td>0</td>\n",
       "      <td>[0,0,0,0,0,0,0,0,0,0]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   source                                          embedding  movie  0  \\\n",
       "0    9891  [0.0020742759,0.0050524846,-0.003386466,0.0028...   4321  0   \n",
       "1    9891  [0.0054219505,0.0052860463,-0.0050404333,-0.00...    135  0   \n",
       "2    9891  [0.0024830783,-0.003575973,0.0061229025,0.0041...   5285  0   \n",
       "3    9891  [0.0069850828,0.0008707234,0.0068662665,0.0029...   2741  0   \n",
       "4    9891  [-0.006761877,0.0060815695,0.0057708365,0.0073...    559  0   \n",
       "\n",
       "                 ratings  \n",
       "0  [0,0,0,0,0,0,0,0,0,0]  \n",
       "1  [0,0,0,0,0,0,0,0,0,0]  \n",
       "2  [0,0,0,0,0,0,0,0,0,0]  \n",
       "3  [0,0,0,0,0,0,0,0,0,0]  \n",
       "4  [0,0,0,0,0,0,0,0,0,0]  "
      ]
     },
     "execution_count": 75,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "predict_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [],
   "source": [
    "predict_df = pd.read_csv('predict_test.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Since we are using nodeIds here, I have to recreate the nodeIds to have the same id."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   source                                          embedding  movie  0  \\\n",
      "0    9891  [0.0020742759,0.0050524846,-0.003386466,0.0028...   4321  0   \n",
      "1    9891  [0.0054219505,0.0052860463,-0.0050404333,-0.00...    135  0   \n",
      "2    9891  [0.0024830783,-0.003575973,0.0061229025,0.0041...   5285  0   \n",
      "3    9891  [0.0069850828,0.0008707234,0.0068662665,0.0029...   2741  0   \n",
      "4    9891  [-0.006761877,0.0060815695,0.0057708365,0.0073...    559  0   \n",
      "\n",
      "                 ratings  \n",
      "0  [0,0,0,0,0,0,0,0,0,0]  \n",
      "1  [0,0,0,0,0,0,0,0,0,0]  \n",
      "2  [0,0,0,0,0,0,0,0,0,0]  \n",
      "3  [0,0,0,0,0,0,0,0,0,0]  \n",
      "4  [0,0,0,0,0,0,0,0,0,0]  \n"
     ]
    }
   ],
   "source": [
    "print(predict_df.head())\n",
    "expected_df = predict_df[[\"ratings\", \"source\", \"movie\"]]\n",
    "\n",
    "predict_x = predict_df.loc[:, \"embedding\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\ipykernel_launcher.py:3: FutureWarning: The 'get_values' method is deprecated and will be removed in a future version. Use '.to_numpy()' or '.array' instead.\n",
      "  This is separate from the ipykernel package so we can avoid doing imports until\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>...</th>\n",
       "      <th>54</th>\n",
       "      <th>55</th>\n",
       "      <th>56</th>\n",
       "      <th>57</th>\n",
       "      <th>58</th>\n",
       "      <th>59</th>\n",
       "      <th>60</th>\n",
       "      <th>61</th>\n",
       "      <th>62</th>\n",
       "      <th>63</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>[0.0020742759</td>\n",
       "      <td>0.0050524846</td>\n",
       "      <td>-0.003386466</td>\n",
       "      <td>0.002862444</td>\n",
       "      <td>0.00557112</td>\n",
       "      <td>0.002237879</td>\n",
       "      <td>-0.001169441</td>\n",
       "      <td>-0.007466705</td>\n",
       "      <td>-0.0018846508</td>\n",
       "      <td>-0.0026723407</td>\n",
       "      <td>...</td>\n",
       "      <td>-0.00095538155</td>\n",
       "      <td>0.0060781054</td>\n",
       "      <td>-0.006508058</td>\n",
       "      <td>-0.0020968332</td>\n",
       "      <td>-0.00061050185</td>\n",
       "      <td>-0.00022153075</td>\n",
       "      <td>0.0031861581</td>\n",
       "      <td>-0.00094912347</td>\n",
       "      <td>0.0021690875</td>\n",
       "      <td>-0.0014343751]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>[0.0054219505</td>\n",
       "      <td>0.0052860463</td>\n",
       "      <td>-0.0050404333</td>\n",
       "      <td>-0.0065103793</td>\n",
       "      <td>0.0029423</td>\n",
       "      <td>0.00093608623</td>\n",
       "      <td>-0.002902685</td>\n",
       "      <td>-0.0050046993</td>\n",
       "      <td>-0.006511066</td>\n",
       "      <td>0.005662674</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0025054498</td>\n",
       "      <td>0.007454763</td>\n",
       "      <td>-0.0070858933</td>\n",
       "      <td>0.007696981</td>\n",
       "      <td>0.0029311026</td>\n",
       "      <td>0.0048488313</td>\n",
       "      <td>-0.004549181</td>\n",
       "      <td>0.003987452</td>\n",
       "      <td>0.0034448318</td>\n",
       "      <td>0.0024883177]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>[0.0024830783</td>\n",
       "      <td>-0.003575973</td>\n",
       "      <td>0.0061229025</td>\n",
       "      <td>0.004178299</td>\n",
       "      <td>0.0019051132</td>\n",
       "      <td>0.00072764076</td>\n",
       "      <td>0.0008645881</td>\n",
       "      <td>0.0061498433</td>\n",
       "      <td>0.0002999682</td>\n",
       "      <td>0.005600294</td>\n",
       "      <td>...</td>\n",
       "      <td>0.005215622</td>\n",
       "      <td>-0.0069602537</td>\n",
       "      <td>0.0039596274</td>\n",
       "      <td>0.0060902224</td>\n",
       "      <td>0.007455875</td>\n",
       "      <td>0.0026260286</td>\n",
       "      <td>0.0017336925</td>\n",
       "      <td>-0.005638495</td>\n",
       "      <td>-0.003803534</td>\n",
       "      <td>0.0073580784]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>[0.0069850828</td>\n",
       "      <td>0.0008707234</td>\n",
       "      <td>0.0068662665</td>\n",
       "      <td>0.0029306384</td>\n",
       "      <td>-0.0034020022</td>\n",
       "      <td>-0.0017614625</td>\n",
       "      <td>0.00026415923</td>\n",
       "      <td>-0.0042918283</td>\n",
       "      <td>0.0019480693</td>\n",
       "      <td>0.005610656</td>\n",
       "      <td>...</td>\n",
       "      <td>-0.0011373039</td>\n",
       "      <td>-0.006068216</td>\n",
       "      <td>0.0047586504</td>\n",
       "      <td>-0.002103879</td>\n",
       "      <td>0.002875452</td>\n",
       "      <td>-0.007034545</td>\n",
       "      <td>0.0077809896</td>\n",
       "      <td>0.0059217717</td>\n",
       "      <td>-0.0040861224</td>\n",
       "      <td>0.0075356713]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>[-0.006761877</td>\n",
       "      <td>0.0060815695</td>\n",
       "      <td>0.0057708365</td>\n",
       "      <td>0.0073650675</td>\n",
       "      <td>0.00021214629</td>\n",
       "      <td>0.005643109</td>\n",
       "      <td>0.007186707</td>\n",
       "      <td>-0.0051961355</td>\n",
       "      <td>0.005609921</td>\n",
       "      <td>-0.00660391</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0070847776</td>\n",
       "      <td>-0.0014172879</td>\n",
       "      <td>0.0039330935</td>\n",
       "      <td>-0.005759567</td>\n",
       "      <td>-0.0075020203</td>\n",
       "      <td>0.007301927</td>\n",
       "      <td>-0.0058451365</td>\n",
       "      <td>-0.0060837604</td>\n",
       "      <td>-0.005616533</td>\n",
       "      <td>-0.005398597]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>595</td>\n",
       "      <td>[-0.002698713</td>\n",
       "      <td>0.006218801</td>\n",
       "      <td>-0.0077919387</td>\n",
       "      <td>-0.006110709</td>\n",
       "      <td>0.003944708</td>\n",
       "      <td>0.005787083</td>\n",
       "      <td>0.0067991405</td>\n",
       "      <td>0.006844533</td>\n",
       "      <td>0.006096161</td>\n",
       "      <td>-0.0039038134</td>\n",
       "      <td>...</td>\n",
       "      <td>0.007222826</td>\n",
       "      <td>0.00007354563</td>\n",
       "      <td>-0.00086594233</td>\n",
       "      <td>-0.003642436</td>\n",
       "      <td>0.0014499583</td>\n",
       "      <td>0.0016078291</td>\n",
       "      <td>0.0049042753</td>\n",
       "      <td>-0.005262406</td>\n",
       "      <td>-0.004805527</td>\n",
       "      <td>0.0071064224]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>596</td>\n",
       "      <td>[0.0010814407</td>\n",
       "      <td>-0.006123218</td>\n",
       "      <td>0.0014991675</td>\n",
       "      <td>-0.004086072</td>\n",
       "      <td>0.0047220406</td>\n",
       "      <td>0.00059033063</td>\n",
       "      <td>-0.00032910967</td>\n",
       "      <td>0.0014812927</td>\n",
       "      <td>0.0011673814</td>\n",
       "      <td>-0.00088125106</td>\n",
       "      <td>...</td>\n",
       "      <td>-0.0015354764</td>\n",
       "      <td>-0.00043749536</td>\n",
       "      <td>-0.005216136</td>\n",
       "      <td>-0.0053904965</td>\n",
       "      <td>-0.005120135</td>\n",
       "      <td>-0.00048819205</td>\n",
       "      <td>0.00024717982</td>\n",
       "      <td>-0.00023823157</td>\n",
       "      <td>-0.0011707927</td>\n",
       "      <td>0.002331914]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>597</td>\n",
       "      <td>[-0.006656878</td>\n",
       "      <td>-0.007336678</td>\n",
       "      <td>-0.0033994315</td>\n",
       "      <td>-0.0025859498</td>\n",
       "      <td>0.0072017834</td>\n",
       "      <td>0.007331917</td>\n",
       "      <td>-0.002995128</td>\n",
       "      <td>-0.005485141</td>\n",
       "      <td>-0.003019573</td>\n",
       "      <td>-0.0065631494</td>\n",
       "      <td>...</td>\n",
       "      <td>0.0046523786</td>\n",
       "      <td>-0.007166286</td>\n",
       "      <td>-0.0015471169</td>\n",
       "      <td>-0.0049862307</td>\n",
       "      <td>-0.005731581</td>\n",
       "      <td>-0.006960357</td>\n",
       "      <td>0.0068321973</td>\n",
       "      <td>-0.004985357</td>\n",
       "      <td>-0.003724244</td>\n",
       "      <td>0.0071719056]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>598</td>\n",
       "      <td>[-0.00018177432</td>\n",
       "      <td>0.004892791</td>\n",
       "      <td>0.0070315786</td>\n",
       "      <td>-0.0052663307</td>\n",
       "      <td>0.0006688544</td>\n",
       "      <td>0.004919152</td>\n",
       "      <td>0.007121826</td>\n",
       "      <td>-0.0059099006</td>\n",
       "      <td>-0.0016583222</td>\n",
       "      <td>0.0021765295</td>\n",
       "      <td>...</td>\n",
       "      <td>-0.0028237654</td>\n",
       "      <td>0.0075489604</td>\n",
       "      <td>-0.003454289</td>\n",
       "      <td>-0.0013383521</td>\n",
       "      <td>0.0048158346</td>\n",
       "      <td>-0.005009686</td>\n",
       "      <td>0.0031217514</td>\n",
       "      <td>0.00457758</td>\n",
       "      <td>0.003163943</td>\n",
       "      <td>0.001817258]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>599</td>\n",
       "      <td>[-0.0036301364</td>\n",
       "      <td>0.005981888</td>\n",
       "      <td>-0.006902378</td>\n",
       "      <td>-0.004107418</td>\n",
       "      <td>-0.004224652</td>\n",
       "      <td>-0.0034487478</td>\n",
       "      <td>0.004682143</td>\n",
       "      <td>-0.00012270437</td>\n",
       "      <td>-0.0032198017</td>\n",
       "      <td>-0.004854163</td>\n",
       "      <td>...</td>\n",
       "      <td>-0.0050110277</td>\n",
       "      <td>-0.0070798215</td>\n",
       "      <td>-0.00001531937</td>\n",
       "      <td>0.0049053696</td>\n",
       "      <td>0.0009628115</td>\n",
       "      <td>0.00027792653</td>\n",
       "      <td>-0.0015151602</td>\n",
       "      <td>0.0029300759</td>\n",
       "      <td>0.003309611</td>\n",
       "      <td>-0.0064102546]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>600 rows × 64 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                   0             1              2              3  \\\n",
       "0      [0.0020742759  0.0050524846   -0.003386466    0.002862444   \n",
       "1      [0.0054219505  0.0052860463  -0.0050404333  -0.0065103793   \n",
       "2      [0.0024830783  -0.003575973   0.0061229025    0.004178299   \n",
       "3      [0.0069850828  0.0008707234   0.0068662665   0.0029306384   \n",
       "4      [-0.006761877  0.0060815695   0.0057708365   0.0073650675   \n",
       "..               ...           ...            ...            ...   \n",
       "595    [-0.002698713   0.006218801  -0.0077919387   -0.006110709   \n",
       "596    [0.0010814407  -0.006123218   0.0014991675   -0.004086072   \n",
       "597    [-0.006656878  -0.007336678  -0.0033994315  -0.0025859498   \n",
       "598  [-0.00018177432   0.004892791   0.0070315786  -0.0052663307   \n",
       "599   [-0.0036301364   0.005981888   -0.006902378   -0.004107418   \n",
       "\n",
       "                 4              5               6               7  \\\n",
       "0       0.00557112    0.002237879    -0.001169441    -0.007466705   \n",
       "1        0.0029423  0.00093608623    -0.002902685   -0.0050046993   \n",
       "2     0.0019051132  0.00072764076    0.0008645881    0.0061498433   \n",
       "3    -0.0034020022  -0.0017614625   0.00026415923   -0.0042918283   \n",
       "4    0.00021214629    0.005643109     0.007186707   -0.0051961355   \n",
       "..             ...            ...             ...             ...   \n",
       "595    0.003944708    0.005787083    0.0067991405     0.006844533   \n",
       "596   0.0047220406  0.00059033063  -0.00032910967    0.0014812927   \n",
       "597   0.0072017834    0.007331917    -0.002995128    -0.005485141   \n",
       "598   0.0006688544    0.004919152     0.007121826   -0.0059099006   \n",
       "599   -0.004224652  -0.0034487478     0.004682143  -0.00012270437   \n",
       "\n",
       "                 8               9  ...              54              55  \\\n",
       "0    -0.0018846508   -0.0026723407  ...  -0.00095538155    0.0060781054   \n",
       "1     -0.006511066     0.005662674  ...    0.0025054498     0.007454763   \n",
       "2     0.0002999682     0.005600294  ...     0.005215622   -0.0069602537   \n",
       "3     0.0019480693     0.005610656  ...   -0.0011373039    -0.006068216   \n",
       "4      0.005609921     -0.00660391  ...    0.0070847776   -0.0014172879   \n",
       "..             ...             ...  ...             ...             ...   \n",
       "595    0.006096161   -0.0039038134  ...     0.007222826   0.00007354563   \n",
       "596   0.0011673814  -0.00088125106  ...   -0.0015354764  -0.00043749536   \n",
       "597   -0.003019573   -0.0065631494  ...    0.0046523786    -0.007166286   \n",
       "598  -0.0016583222    0.0021765295  ...   -0.0028237654    0.0075489604   \n",
       "599  -0.0032198017    -0.004854163  ...   -0.0050110277   -0.0070798215   \n",
       "\n",
       "                 56             57              58              59  \\\n",
       "0      -0.006508058  -0.0020968332  -0.00061050185  -0.00022153075   \n",
       "1     -0.0070858933    0.007696981    0.0029311026    0.0048488313   \n",
       "2      0.0039596274   0.0060902224     0.007455875    0.0026260286   \n",
       "3      0.0047586504   -0.002103879     0.002875452    -0.007034545   \n",
       "4      0.0039330935   -0.005759567   -0.0075020203     0.007301927   \n",
       "..              ...            ...             ...             ...   \n",
       "595  -0.00086594233   -0.003642436    0.0014499583    0.0016078291   \n",
       "596    -0.005216136  -0.0053904965    -0.005120135  -0.00048819205   \n",
       "597   -0.0015471169  -0.0049862307    -0.005731581    -0.006960357   \n",
       "598    -0.003454289  -0.0013383521    0.0048158346    -0.005009686   \n",
       "599  -0.00001531937   0.0049053696    0.0009628115   0.00027792653   \n",
       "\n",
       "                60              61             62              63  \n",
       "0     0.0031861581  -0.00094912347   0.0021690875  -0.0014343751]  \n",
       "1     -0.004549181     0.003987452   0.0034448318   0.0024883177]  \n",
       "2     0.0017336925    -0.005638495   -0.003803534   0.0073580784]  \n",
       "3     0.0077809896    0.0059217717  -0.0040861224   0.0075356713]  \n",
       "4    -0.0058451365   -0.0060837604   -0.005616533   -0.005398597]  \n",
       "..             ...             ...            ...             ...  \n",
       "595   0.0049042753    -0.005262406   -0.004805527   0.0071064224]  \n",
       "596  0.00024717982  -0.00023823157  -0.0011707927    0.002331914]  \n",
       "597   0.0068321973    -0.004985357   -0.003724244   0.0071719056]  \n",
       "598   0.0031217514      0.00457758    0.003163943    0.001817258]  \n",
       "599  -0.0015151602    0.0029300759    0.003309611  -0.0064102546]  \n",
       "\n",
       "[600 rows x 64 columns]"
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "predict_x = pd.DataFrame([sub.split(\",\") for sub in predict_x])\n",
    "#predict_x = pd.DataFrame(np.array([np.array(item) for item in predict_x.values]))\n",
    "predict_x.columns = [str(col) for col in predict_x.columns.get_values()]\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [],
   "source": [
    "predict_x['0']= predict_x['0'].str.replace('[', '') \n",
    "predict_x['63']= predict_x['63'].str.replace(']', '') \n",
    "predict_x = predict_x.apply(pd.to_numeric)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def predict_input_fn(predict_x, num):\n",
    "    return  tf.data.Dataset.from_tensors(dict(predict_x))\n",
    "\n",
    "from tensorflow_core.estimator import inputs\n",
    "\n",
    "predictions = classifier.predict(input_fn=lambda: predict_input_fn(predict_x, 100))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predictions: <generator object Estimator.predict at 0x000002B29BEB7548>\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\meetn\\Anaconda3\\lib\\site-packages\\ipykernel_launcher.py:5: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.\n",
      "  \"\"\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "INFO:tensorflow:Calling model_fn.\n",
      "WARNING:tensorflow:Layer linear_model is casting an input tensor from dtype float64 to the layer's dtype of float32, which is new behavior in TensorFlow 2.  The layer has dtype float32 because it's dtype defaults to floatx.\n",
      "\n",
      "If you intended to run this layer in float32, you can safely ignore this warning. If in doubt, this warning is likely only an issue if you are porting a TensorFlow 1.X model to TensorFlow 2.\n",
      "\n",
      "To change all layers to have dtype float64 by default, call `tf.keras.backend.set_floatx('float64')`. To change just this layer, pass dtype='float64' to the layer constructor. If you are the author of this layer, you can disable autocasting by passing autocast=False to the base Layer constructor.\n",
      "\n",
      "INFO:tensorflow:Done calling model_fn.\n",
      "INFO:tensorflow:Graph was finalized.\n",
      "INFO:tensorflow:Restoring parameters from C:\\Users\\meetn\\AppData\\Local\\Temp\\tmpclz8gzqr\\model.ckpt-2000\n",
      "INFO:tensorflow:Running local_init_op.\n",
      "INFO:tensorflow:Done running local_init_op.\n"
     ]
    }
   ],
   "source": [
    "#user movie \n",
    "print('Predictions: {}'.format(str(predictions)))\n",
    "columns=['User_ID', 'Movie', 'Ratings', 'Ratings_percent']\n",
    "lst = []\n",
    "for pred_dict, expec in zip(predictions, expected_df.as_matrix()):\n",
    "    expected, source, movie = expec\n",
    "    #print(source, movie, pred_dict)\n",
    "    #print(\"Movie: {0}\".format(movie))\n",
    "    count=0\n",
    "    for idx, label in enumerate(expected):\n",
    "        if count <= 9:\n",
    "            lst.append([source, movie, ratings[idx], pred_dict[\"probabilities\"][idx]])\n",
    "            count+=1\n",
    "    #print(\"--\")\n",
    "    \n",
    "df1 = pd.DataFrame(lst, columns=columns)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>User_ID</th>\n",
       "      <th>Movie</th>\n",
       "      <th>Ratings</th>\n",
       "      <th>Ratings_percent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>0</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>0.5</td>\n",
       "      <td>0.015418</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.022571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>1.5</td>\n",
       "      <td>0.016499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.062595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>2.5</td>\n",
       "      <td>0.047351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0.203710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>6</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>3.5</td>\n",
       "      <td>0.112429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>7</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286891</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>8</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>4.5</td>\n",
       "      <td>0.097293</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>9</td>\n",
       "      <td>9891</td>\n",
       "      <td>4321</td>\n",
       "      <td>5.0</td>\n",
       "      <td>0.146711</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>10</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>0.5</td>\n",
       "      <td>0.015418</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>11</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.022570</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>12</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>1.5</td>\n",
       "      <td>0.016499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>13</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>2.0</td>\n",
       "      <td>0.062597</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>14</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>2.5</td>\n",
       "      <td>0.047353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>15</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>3.0</td>\n",
       "      <td>0.203691</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>16</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>3.5</td>\n",
       "      <td>0.112443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>17</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286891</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>18</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>4.5</td>\n",
       "      <td>0.097281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>19</td>\n",
       "      <td>9891</td>\n",
       "      <td>135</td>\n",
       "      <td>5.0</td>\n",
       "      <td>0.146701</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    User_ID  Movie  Ratings  Ratings_percent\n",
       "0      9891   4321      0.5         0.015418\n",
       "1      9891   4321      1.0         0.022571\n",
       "2      9891   4321      1.5         0.016499\n",
       "3      9891   4321      2.0         0.062595\n",
       "4      9891   4321      2.5         0.047351\n",
       "5      9891   4321      3.0         0.203710\n",
       "6      9891   4321      3.5         0.112429\n",
       "7      9891   4321      4.0         0.286891\n",
       "8      9891   4321      4.5         0.097293\n",
       "9      9891   4321      5.0         0.146711\n",
       "10     9891    135      0.5         0.015418\n",
       "11     9891    135      1.0         0.022570\n",
       "12     9891    135      1.5         0.016499\n",
       "13     9891    135      2.0         0.062597\n",
       "14     9891    135      2.5         0.047353\n",
       "15     9891    135      3.0         0.203691\n",
       "16     9891    135      3.5         0.112443\n",
       "17     9891    135      4.0         0.286891\n",
       "18     9891    135      4.5         0.097281\n",
       "19     9891    135      5.0         0.146701"
      ]
     },
     "execution_count": 107,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#User and the movies that they ahve not rated. Prediction of each ratings per user\n",
    "df1.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [],
   "source": [
    "df1.to_csv(\"predicted_out.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Sort the data frame based on Ratings_percent\n",
    "df2 = df1.sort_values('Ratings_percent',ascending = False).groupby('User_ID').head(10)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>User_ID</th>\n",
       "      <th>Movie</th>\n",
       "      <th>Ratings</th>\n",
       "      <th>Ratings_percent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>2127</td>\n",
       "      <td>5150</td>\n",
       "      <td>858</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286970</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>847</td>\n",
       "      <td>9891</td>\n",
       "      <td>1620</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286949</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3017</td>\n",
       "      <td>9810</td>\n",
       "      <td>2276</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286948</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>687</td>\n",
       "      <td>9891</td>\n",
       "      <td>2276</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286948</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5877</td>\n",
       "      <td>9889</td>\n",
       "      <td>228</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286946</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4217</td>\n",
       "      <td>9829</td>\n",
       "      <td>1542</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286945</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1087</td>\n",
       "      <td>9957</td>\n",
       "      <td>1542</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286945</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2597</td>\n",
       "      <td>5150</td>\n",
       "      <td>2137</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286945</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2057</td>\n",
       "      <td>5150</td>\n",
       "      <td>1983</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286942</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1017</td>\n",
       "      <td>9957</td>\n",
       "      <td>582</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286942</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>927</td>\n",
       "      <td>9891</td>\n",
       "      <td>157</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286941</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3077</td>\n",
       "      <td>9810</td>\n",
       "      <td>1748</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>917</td>\n",
       "      <td>9891</td>\n",
       "      <td>6186</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4547</td>\n",
       "      <td>9829</td>\n",
       "      <td>2430</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286939</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3737</td>\n",
       "      <td>9810</td>\n",
       "      <td>2624</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286937</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4927</td>\n",
       "      <td>9829</td>\n",
       "      <td>3237</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286936</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>197</td>\n",
       "      <td>9891</td>\n",
       "      <td>2438</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286935</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5287</td>\n",
       "      <td>9889</td>\n",
       "      <td>2438</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286935</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3647</td>\n",
       "      <td>9810</td>\n",
       "      <td>1282</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286935</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4467</td>\n",
       "      <td>9829</td>\n",
       "      <td>1282</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286935</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1247</td>\n",
       "      <td>9957</td>\n",
       "      <td>1244</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286931</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2317</td>\n",
       "      <td>5150</td>\n",
       "      <td>3243</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286931</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>327</td>\n",
       "      <td>9891</td>\n",
       "      <td>5936</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4657</td>\n",
       "      <td>9829</td>\n",
       "      <td>907</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286928</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5457</td>\n",
       "      <td>9889</td>\n",
       "      <td>4936</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286928</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3207</td>\n",
       "      <td>9810</td>\n",
       "      <td>300</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286926</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1707</td>\n",
       "      <td>9957</td>\n",
       "      <td>290</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286926</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1677</td>\n",
       "      <td>9957</td>\n",
       "      <td>4604</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286925</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2787</td>\n",
       "      <td>5150</td>\n",
       "      <td>5772</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286925</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3037</td>\n",
       "      <td>9810</td>\n",
       "      <td>2362</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286925</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2917</td>\n",
       "      <td>5150</td>\n",
       "      <td>2362</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286925</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2027</td>\n",
       "      <td>5150</td>\n",
       "      <td>2929</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286925</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2517</td>\n",
       "      <td>5150</td>\n",
       "      <td>895</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>647</td>\n",
       "      <td>9891</td>\n",
       "      <td>1217</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1327</td>\n",
       "      <td>9957</td>\n",
       "      <td>867</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>2227</td>\n",
       "      <td>5150</td>\n",
       "      <td>7802</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3847</td>\n",
       "      <td>9810</td>\n",
       "      <td>492</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1727</td>\n",
       "      <td>9957</td>\n",
       "      <td>182</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4687</td>\n",
       "      <td>9829</td>\n",
       "      <td>2261</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5267</td>\n",
       "      <td>9889</td>\n",
       "      <td>955</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4897</td>\n",
       "      <td>9829</td>\n",
       "      <td>4066</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4507</td>\n",
       "      <td>9829</td>\n",
       "      <td>324</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>4287</td>\n",
       "      <td>9829</td>\n",
       "      <td>324</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5537</td>\n",
       "      <td>9889</td>\n",
       "      <td>8233</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>3867</td>\n",
       "      <td>9810</td>\n",
       "      <td>6387</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286921</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>317</td>\n",
       "      <td>9891</td>\n",
       "      <td>4972</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286921</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5107</td>\n",
       "      <td>9889</td>\n",
       "      <td>4972</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286921</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1877</td>\n",
       "      <td>9957</td>\n",
       "      <td>6205</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286921</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>5397</td>\n",
       "      <td>9889</td>\n",
       "      <td>2393</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286921</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>1577</td>\n",
       "      <td>9957</td>\n",
       "      <td>8606</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0.286921</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      User_ID  Movie  Ratings  Ratings_percent\n",
       "2127     5150    858      4.0         0.286970\n",
       "847      9891   1620      4.0         0.286949\n",
       "3017     9810   2276      4.0         0.286948\n",
       "687      9891   2276      4.0         0.286948\n",
       "5877     9889    228      4.0         0.286946\n",
       "4217     9829   1542      4.0         0.286945\n",
       "1087     9957   1542      4.0         0.286945\n",
       "2597     5150   2137      4.0         0.286945\n",
       "2057     5150   1983      4.0         0.286942\n",
       "1017     9957    582      4.0         0.286942\n",
       "927      9891    157      4.0         0.286941\n",
       "3077     9810   1748      4.0         0.286940\n",
       "917      9891   6186      4.0         0.286940\n",
       "4547     9829   2430      4.0         0.286939\n",
       "3737     9810   2624      4.0         0.286937\n",
       "4927     9829   3237      4.0         0.286936\n",
       "197      9891   2438      4.0         0.286935\n",
       "5287     9889   2438      4.0         0.286935\n",
       "3647     9810   1282      4.0         0.286935\n",
       "4467     9829   1282      4.0         0.286935\n",
       "1247     9957   1244      4.0         0.286931\n",
       "2317     5150   3243      4.0         0.286931\n",
       "327      9891   5936      4.0         0.286930\n",
       "4657     9829    907      4.0         0.286928\n",
       "5457     9889   4936      4.0         0.286928\n",
       "3207     9810    300      4.0         0.286926\n",
       "1707     9957    290      4.0         0.286926\n",
       "1677     9957   4604      4.0         0.286925\n",
       "2787     5150   5772      4.0         0.286925\n",
       "3037     9810   2362      4.0         0.286925\n",
       "2917     5150   2362      4.0         0.286925\n",
       "2027     5150   2929      4.0         0.286925\n",
       "2517     5150    895      4.0         0.286924\n",
       "647      9891   1217      4.0         0.286924\n",
       "1327     9957    867      4.0         0.286924\n",
       "2227     5150   7802      4.0         0.286924\n",
       "3847     9810    492      4.0         0.286924\n",
       "1727     9957    182      4.0         0.286923\n",
       "4687     9829   2261      4.0         0.286923\n",
       "5267     9889    955      4.0         0.286922\n",
       "4897     9829   4066      4.0         0.286922\n",
       "4507     9829    324      4.0         0.286922\n",
       "4287     9829    324      4.0         0.286922\n",
       "5537     9889   8233      4.0         0.286922\n",
       "3867     9810   6387      4.0         0.286921\n",
       "317      9891   4972      4.0         0.286921\n",
       "5107     9889   4972      4.0         0.286921\n",
       "1877     9957   6205      4.0         0.286921\n",
       "5397     9889   2393      4.0         0.286921\n",
       "1577     9957   8606      4.0         0.286921"
      ]
     },
     "execution_count": 111,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df2.head(50)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [],
   "source": [
    "df2.to_csv('Node2VecRatings_Output_Eval.csv')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
